STMicroelectronics/X-CUBE-NFC4/Drivers/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_hal_tmpsens.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_tmpsens.h
  * @author  MCD Application Team
  * @version V0.0.1
  * @date    01-July-2016
  * @brief   Header file of DTS HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP1xx_HAL_DTS_H
#define __STM32MP1xx_HAL_DTS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal_def.h"

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @addtogroup DTS
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup DTS_Exported_Types DTS Exported Types
  * @{
  */

/**
  * @brief  DTS Init structure definition
  */
typedef struct
{
  uint32_t QuickMeasure;  /*!< Specifies the quick measure option selection of
                               the DTS sensor.
                               This parameter can be a value of
                               @ref DTS_QUIKMEAS */

  uint32_t RefClock;      /*!< Specifies the reference clock selection of the
                               DTS sensor.
                               This parameter can be a value of @ref
                               DTS_REFCLKSEL */

  uint32_t TriggerInput;  /*!< Specifies the trigger input of the DTS
                               sensor.
                               This parameter can be a value of @ref
                               DTS_TriggerConfig */

  uint32_t SamplingTime;  /*!< Specifies the sampling time configuration.
                               This parameter can be a value of @ref
                               DTS_SMP_TIME */

  uint32_t Divider;       /*!< Specifies the high speed clock divider ratio */

  uint32_t InterruptSource; /*!< Specifies the interrupt source of the
                                 DTS sensor.
                                 This parameter can be a value of @ref
                                 DTS_InterruptSource_Definitions */

  uint32_t HighInterruptThreshold;  /*!< Specifies the high Interrupt threshold
                                         of the DTS sensor */

  uint32_t LowInterruptThreshold; /*!<  Specifies the low Interrupt threshold of
                                        the DTS sensor */
#ifdef __STM32MP1xx_H
  uint32_t WakeupTarget;  /*!< Specifies the Wakeup Target.
                               This parameter can be a value of @ref
                               DTS_WakeupTarget_Definitions */
#endif
} DTS_InitTypeDef;


/**
  * @brief  DTS Measure structure definition
  */
typedef struct
{
  int32_t Ts1_Sample;    /*!< Specifies the measured sample number for DTS1
                              (for debug purposes) */
  int32_t Ts1_Fmt;       /*!< Specifies the measured frequency for DTS1
                              (for debug purposes) */
  int32_t Ts1_Temp;      /*!< Specifies the measured temperature for DTS1 */
  uint32_t Ts1_Count_R;   /*!< Specifies the number of reads before getting a SW
                               measured temperature for DTS1
                               (for debug purposes)*/
} DTS_MeasureTypeDef;

/**
  * @brief  HAL State structures definition
  */
typedef enum
{
  HAL_DTS_STATE_RESET       = 0x00, /*!< DTS not yet initialized or
                                             disabled */
  HAL_DTS_STATE_READY       = 0x01, /*!< DTS initialized and ready for
                                             use */
  HAL_DTS_STATE_CALIBBUSY   = 0x02, /*!< DTS is enabled in auto
                                             calibration mode */
  HAL_DTS_STATE_BUSY        = 0x03, /*!< DTS is running */
  HAL_DTS_STATE_BUSY_LOCKED = 0x04  /*!< DTS is running and the
                                             configuration is locked */
} HAL_DTS_StateTypeDef;

/**
  * @brief  DTS Handle Structure definition
  */
typedef struct
{
  DTS_TypeDef         *Instance;    /*!< Register base address */
  DTS_InitTypeDef     Init;         /*!< DTS required parameters */
  DTS_MeasureTypeDef  Measure;      /*!< Measured values */
  HAL_LockTypeDef         Lock;         /*!< Locking object */
  __IO HAL_DTS_StateTypeDef  State; /*!< COMP communication state */
} DTS_HandleTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup DTS_Exported_Constants DTS Exported Constants
  * @{
  */

/** @defgroup DTS_TriggerConfig  DTS Trigger Configuration
  * @{
  */

/* @brief No Hardware trigger detection */
#define DTS_TRIGGER_HW_NONE   (0U)

/* @brief External Interrupt Mode with LPTIMER1 trigger detection */
#define DTS_TRIGGER_LPTIMER1  DTS_CFGR1_TS1_INTRIG_SEL_0

/* @brief External Interrupt Mode with LPTIMER2 trigger detection */
#define DTS_TRIGGER_LPTIMER2  DTS_CFGR1_TS1_INTRIG_SEL_1

/* @brief External Interrupt Mode with LPTIMER3 trigger detection */
#define DTS_TRIGGER_LPTIMER3  ((uint32_t)DTS_CFGR1_TS1_INTRIG_SEL_0 \
                                   | DTS_CFGR1_TS1_INTRIG_SEL_1)

/* @brief External Interrupt Mode with EXTI13 trigger detection */
#define DTS_TRIGGER_SYSCFG_EXTI13 DTS_CFGR1_TS1_INTRIG_SEL_2

/* @brief No Hardware trigger detection on continuous mode */
#define DTS_TRIGGER_HW_NONE_CONT  ((uint32_t)DTS_CFGR1_TS1_INTRIG_SEL_0 \
                                       | DTS_CFGR1_TS1_INTRIG_SEL_1 \
                                       | DTS_CFGR1_TS1_INTRIG_SEL_2)
/**
  * @}
  */

/** @defgroup DTS_QUIKMEAS  DTS Quick Measurement
  * @{
  */
#define DTS_QUICKMEAS_ENABLE \
          DTS_CFGR1_Q_MEAS_OPT      /*!< Enable the Quick Measure (Measure
                                             without calibration) */
#define DTS_QUICKMEAS_DISABLE (0U)  /*!< Disable the Quick Measure (Measure
                                             with calibration) */
/**
  * @}
  */

/** @defgroup DTS_REFCLKSEL   DTS Reference Clock Selection
  * @{
  */
#define DTS_REFCLKSEL_LSE \
          DTS_CFGR1_REFCLK_SEL  /*!< Low speed REF clock (LSE) */
#define DTS_REFCLKSEL_PCLK (0U) /*!< High speed REF clock (PCLK) */

/**
  * @}
  */

