STMicroelectronics/X-CUBE-NFC4/Drivers/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_hal_tmpsens.h
/** @defgroup DTS_SMP_TIME   DTS Sampling Time
  * @{
  */
#define DTS_SMP_TIME_1_CYCLE    ((uint32_t)(0x00000000 | DTS_CFGR1_TS1_SMP_TIME_0))                     /*!< 1 clock cycle for the sampling time  */
#define DTS_SMP_TIME_2_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_1))                                  /*!< 2 clock cycle for the sampling time  */
#define DTS_SMP_TIME_3_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_1))   /*!< 3 clock cycle for the sampling time  */
#define DTS_SMP_TIME_4_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_2))                                  /*!< 4 clock cycle for the sampling time  */
#define DTS_SMP_TIME_5_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_2))   /*!< 5 clock cycle for the sampling time  */
#define DTS_SMP_TIME_6_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_1 | DTS_CFGR1_TS1_SMP_TIME_2))   /*!< 6 clock cycle for the sampling time  */
#define DTS_SMP_TIME_7_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_1 | DTS_CFGR1_TS1_SMP_TIME_2))     /*!< 7 clock cycle for the sampling time  */
#define DTS_SMP_TIME_8_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_3))                                  /*!< 8 clock cycle for the sampling time  */
#define DTS_SMP_TIME_9_CYCLE    ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_3))   /*!< 9 clock cycle for the sampling time  */
#define DTS_SMP_TIME_10_CYCLE   ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_1 | DTS_CFGR1_TS1_SMP_TIME_3))   /*!< 10 clock cycle for the sampling time */
#define DTS_SMP_TIME_11_CYCLE   ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_1 | DTS_CFGR1_TS1_SMP_TIME_3))     /*!< 11 clock cycle for the sampling time */
#define DTS_SMP_TIME_12_CYCLE   ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_2 | DTS_CFGR1_TS1_SMP_TIME_3))   /*!< 12 clock cycle for the sampling time */
#define DTS_SMP_TIME_13_CYCLE   ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_2 | DTS_CFGR1_TS1_SMP_TIME_3))     /*!< 13 clock cycle for the sampling time */
#define DTS_SMP_TIME_14_CYCLE   ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_1 | DTS_CFGR1_TS1_SMP_TIME_2 | DTS_CFGR1_TS1_SMP_TIME_3))     /*!< 14 clock cycle for the sampling time */
#define DTS_SMP_TIME_15_CYCLE   ((uint32_t)(DTS_CFGR1_TS1_SMP_TIME_0 | DTS_CFGR1_TS1_SMP_TIME_1 | DTS_CFGR1_TS1_SMP_TIME_2 | DTS_CFGR1_TS1_SMP_TIME_3)) /*!< 15 clock cycle for the sampling time */

/**
  * @}
  */
/** @defgroup DTS_InterruptSource_Definitions  DTS Interrupt Source Definitions
  * @{
  */
#define DTS_ITSRC_HIGH      DTS_ITENR_TS1_ITHEN
#define DTS_ITSRC_LOW       DTS_ITENR_TS1_ITLEN
#define DTS_ITSRC_END       DTS_ITENR_TS1_ITEEN
#define DTS_ITSRC_ASYN_HIGH DTS_ITENR_TS1_AITHEN
#define DTS_ITSRC_ASYN_LOW  DTS_ITENR_TS1_AITLEN
#define DTS_ITSRC_ASYN_END  DTS_ITENR_TS1_AITEEN

/**
  * @}
  */

/** @defgroup DTS_WakeupTarget_Definitions DTS Wakeup Target Definitions
  * @{
  */
#define DTS_WAKEUPTARGET_CPU1 (1U)
#define DTS_WAKEUPTARGET_CPU2 (2U)
/**
  * @}
  */
/** @defgroup DTS_Flag DTS Flag
  * @{
  */
#define DTS_FLAG_TS1_ITEF   DTS_SR_TS1_ITEF   /*!< Interrupt flag for end of measure for DTS1 */
#define DTS_FLAG_TS1_ITLF   DTS_SR_TS1_ITLF   /*!< Interrupt flag for low threshold for DTS1  */
#define DTS_FLAG_TS1_ITHF   DTS_SR_TS1_ITHF   /*!< Interrupt flag for high threshold for DTS1 */
#define DTS_FLAG_TS1_AITEF  DTS_SR_TS1_AITEF  /*!< Asynchronous Interrupt flag for end of measure for DTS1 */
#define DTS_FLAG_TS1_AITLF  DTS_SR_TS1_AITLF  /*!< Asynchronous Interrupt flag for low threshold for DTS1  */
#define DTS_FLAG_TS1_AITHF  DTS_SR_TS1_AITHF  /*!< Asynchronous Interrupt flag for high threshold for DTS1 */
#define DTS_FLAG_TS1_RDY    DTS_SR_TS1_RDY    /*!< Ready flag for DTS1 */

/**
  * @}
  */
/** @defgroup DTS_IT_CLEAR Flags  DTS Interruption Clear Flags
  * @{
  */
#define DTS_CLEAR_TS1_CITEF   DTS_ICIFR_TS1_CITEF   /*!< Clear Interrupt flag for end of measure for DTS1 */
#define DTS_CLEAR_TS1_CITLF   DTS_ICIFR_TS1_CITLF   /*!< Clear Interrupt flag for low threshold for DTS1  */
#define DTS_CLEAR_TS1_CITHF   DTS_ICIFR_TS1_CITHF   /*!< Clear Interrupt flag for high threshold for DTS1 */
#define DTS_CLEAR_TS1_CAITEF  DTS_ICIFR_TS1_CAITEF  /*!< Clear Asynchronous Interrupt flag for end of measure for DTS1 */
#define DTS_CLEAR_TS1_CAITLF  DTS_ICIFR_TS1_CAITLF  /*!< Clear Asynchronous Interrupt flag for low threshold for DTS1  */
#define DTS_CLEAR_TS1_CAITHF  DTS_ICIFR_TS1_CAITHF  /*!< Clear Asynchronous Interrupt flag for high threshold for DTS1 */

/**
  * @}
  */
/** @defgroup DTS_Interrupts_Definitions DTS Interrupts Definitions
  * @{
  */
#define DTS_IT_TS1_ITEEN  DTS_ITENR_TS1_ITEEN   /*!< Enable interrupt flag for end of measure for DTS1 */
#define DTS_IT_TS1_ITLEN  DTS_ITENR_TS1_ITLEN   /*!< Enable interrupt flag for low threshold for DTS1  */
#define DTS_IT_TS1_ITHEN  DTS_ITENR_TS1_ITHEN   /*!< Enable interrupt flag for high threshold for DTS1 */
#define DTS_IT_TS1_AITEEN DTS_ITENR_TS1_AITEEN  /*!< Enable asynchronous interrupt flag for end of measure for DTS1 */
#define DTS_IT_TS1_AITLEN DTS_ITENR_TS1_AITLEN  /*!< Enable asynchronous interrupt flag for low threshold for DTS1  */
#define DTS_IT_TS1_AITHEN DTS_ITENR_TS1_AITHEN  /*!< Enable asynchronous interrupt flag for high threshold for DTS1 */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macros -----------------------------------------------------------*/
/** @defgroup DTS_Exported_Macros DTS Exported Macros
  * @{
  */

/** @brief  Reset DTS handle state
  * @param  __HANDLE__ DTS handle.
  * @retval None
  */
#define __HAL_DTS_RESET_HANDLE_STATE(__HANDLE__)  \
        ((__HANDLE__)->State = HAL_DTS_STATE_RESET)

/**
  * @brief  Enable the specified DTS sensor
  * @param  __HANDLE__ DTS handle.
  * @retval None
  */
#define __HAL_DTS_ENABLE(__HANDLE__)  \
        SET_BIT((__HANDLE__)->Instance->CFGR1, DTS_CFGR1_TS1_EN)

/**
  * @brief  Disable the specified DTS sensor
  * @param  __HANDLE__ DTS handle.
  * @retval None
  */
#define __HAL_DTS_DISABLE(__HANDLE__) \
        CLEAR_BIT((__HANDLE__)->Instance->CFGR1, DTS_CFGR1_TS1_EN)

#if defined(CORE_CA7)
/**
  * @brief  Enable the DTS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_DTS_EXTI_ENABLE_IT()  \
        SET_BIT(EXTI_C1->IMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Disable the DTS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_DTS_EXTI_DISABLE_IT() \
        CLEAR_BIT(EXTI_C1->IMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Enable the DTS EXTI Line in event mode
  * @retval None
  */
#define __HAL_DTS_EXTI_ENABLE_EVENT() \
        SET_BIT(EXTI_C1->EMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Disable the DTS EXTI Line in event mode
  * @retval None
  */
#define __HAL_DTS_EXTI_DISABLE_EVENT()  \
        CLEAR_BIT(EXTI_C1->EMR3, DTS_EXTI_LINE_DTS1)

