STMicroelectronics/X-CUBE-NFC4/Drivers/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_hal_tmpsens.h
#elif defined(CORE_CM4)

/**
  * @brief  Enable the DTS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_DTS_EXTI_ENABLE_IT()  \
        SET_BIT(EXTI_C2->IMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Disable the DTS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_DTS_EXTI_DISABLE_IT() \
        CLEAR_BIT(EXTI_C2->IMR3,DTS_EXTI_LINE_DTS1)


/**
  * @brief  Enable the DTS EXTI Line in event mode
  * @retval None
  */
#define __HAL_DTS_EXTI_ENABLE_EVENT() \
        SET_BIT(EXTI_C2->EMR3,DTS_EXTI_LINE_DTS1)


/**
  * @brief  Disable the DTS EXTI Line in event mode
  * @retval None
  */
#define __HAL_DTS_EXTI_DISABLE_EVENT()  \
        CLEAR_BIT(EXTI_C2->EMR3, DTS_EXTI_LINE_DTS1)

#endif /* CORE_CM4 */

/** @brief  Checks whether the specified DTS flag is set or not.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg DTS_FLAG_TS1_ITEF:  Interrupt flag for end of measure for DTS1
  *            @arg DTS_FLAG_TS1_ITLF:  Interrupt flag for low threshold for DTS1
  *            @arg DTS_FLAG_TS1_ITHF:  Interrupt flag for high threshold for DTS1
  *            @arg DTS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_FLAG_TS1_RDY:   Ready flag for DTS1
  *            @retval The new state of __FLAG__ (SET or RESET).
  */
#define __HAL_DTS_GET_FLAG(__HANDLE__, __FLAG__)  \
        (((((__HANDLE__)->Instance->SR &(__FLAG__)) == (__FLAG__)))? SET : RESET)


/** @brief  Clears the specified DTS pending flag.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg DTS_CLEAR_TS1_CITEF: Clear Interrupt flag for end of measure for DTS1
  *            @arg DTS_CLEAR_TS1_CITLF: Clear Interrupt flag for low threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CITHF: Clear Interrupt flag for high threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for DTS1
  * @retval None
  */
#define __HAL_DTS_CLEAR_FLAG(__HANDLE__, __FLAG__)  \
        ((__HANDLE__)->Instance->ICIFR  = (__FLAG__))


/** @brief  Enable the specified DTS interrupt.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __INTERRUPT__ specifies the DTS interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg DTS_IT_TS1_ITEEN :Enable interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_ITLEN :Enable interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_ITHEN :Enable interrupt flag for high of measure for DTS1
  *            @arg DTS_IT_TS1_AITEEN :Enable asynchronous interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_AITLEN :Enable asynchronous interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_AITHEN :Enable asynchronous interrupt flag for high of measure for DTS1
  * @retval None
  */
#define __HAL_DTS_ENABLE_IT(__HANDLE__, __INTERRUPT__)  \
        SET_BIT((__HANDLE__)->Instance->ITENR, __INTERRUPT__)


/** @brief  Disable the specified DTS interrupt.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __INTERRUPT__ specifies the DTS interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg DTS_IT_TS1_ITEEN :Enable interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_ITLEN :Enable interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_ITHEN :Enable interrupt flag for high of measure for DTS1
  *            @arg DTS_IT_TS1_AITEEN :Enable asynchronous interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_AITLEN :Enable asynchronous interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_AITHEN :Enable asynchronous interrupt flag for high of measure for DTS1
  * @retval None
  */
#define __HAL_DTS_DISABLE_IT(__HANDLE__,__INTERRUPT__)  \
        CLEAR_BIT((__HANDLE__)->Instance->ITENR, __INTERRUPT__)


/** @brief  Check whether the specified DTS interrupt source is enabled or not.
  * @param __HANDLE__ DTS handle.
  * @param __INTERRUPT__ DTS interrupt source to check
  *          This parameter can be one of the following values:
  *            @arg DTS_IT_TS1_ITEEN :Enable interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_ITLEN :Enable interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_ITHEN :Enable interrupt flag for high of measure for DTS1
  *            @arg DTS_IT_TS1_AITEEN :Enable asynchronous interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_AITLEN :Enable asynchronous interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_AITHEN :Enable asynchronous interrupt flag for high of measure for DTS1
  * @retval State of interruption (SET or RESET)
  */
#define __HAL_DTS_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  \
        (( ((__HANDLE__)->Instance->ITENR & (__INTERRUPT__)) == (__INTERRUPT__) \
        )? SET : RESET)


/** @brief  Check whether the specified DTS REFCLK is selected
  * @param __HANDLE__ DTS handle.
  * @param __REFCLK__ DTS reference clock to check
  *          This parameter can be one of the following values:
  * @arg DTS_REFCLKSEL_LSE:   Low speed REF clock
  * @arg DTS_REFCLKSEL_PCLK:  High speed REF clock
  * @retval State of the REF clock tested (SET or RESET)
  */
#define __HAL_DTS_GET_REFCLK(__HANDLE__, __REFCLK__)  \
        (( ((__HANDLE__)->Instance->CFGR1 & (__REFCLK__)) == (__REFCLK__) \
        )? SET : RESET)

/** @brief  Check whether the specified DTS TRIGGER is selected
  * @param __HANDLE__ DTS handle.
  * @param __TRIGGER__ DTS input trigger to check
  *          This parameter can be one of the following values:
  * @arg DTS_TRIGGER_HW_NONE:       No HW trigger (SW trigger)
  * @arg DTS_TRIGGER_LPTIMER1:      LPTIMER1 trigger
  * @arg DTS_TRIGGER_LPTIMER2:      LPTIMER2 trigger
  * @arg DTS_TRIGGER_LPTIMER3:      LPTIMER3 trigger
  * @arg DTS_TRIGGER_SYSCFG_EXTI13: EXTI13 trigger
  * @retval State of the input TRIGGER tested (SET or RESET)
  */
#define __HAL_DTS_GET_TRIGGER(__HANDLE__, __TRIGGER__)  \
    (( ((__HANDLE__)->Instance->CFGR1 & (DTS_CFGR1_TS1_INTRIG_SEL)) == (__TRIGGER__) \
     )? SET : RESET)
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup DTS_Exported_Functions
  * @{
  */

/** @addtogroup DTS_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_DTS_Init(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_DeInit(DTS_HandleTypeDef *hdts);
void              HAL_DTS_MspInit(DTS_HandleTypeDef *hdts);
void              HAL_DTS_MspDeInit(DTS_HandleTypeDef *hdts);
/**
  * @}
  */

/* IO operation functions  *****************************************************/
/** @addtogroup DTS_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef HAL_DTS_Start(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_Stop(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_GetDTS(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_Start_IT(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_Stop_IT(DTS_HandleTypeDef *hdts);
void              HAL_DTS_IRQHandler(DTS_HandleTypeDef *hdts);
/* Callback in Interrupt mode */
void              HAL_DTS_EndCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_LowCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_HighCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_AsyncEndCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_AsyncLowCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_AsyncHighCallback(DTS_HandleTypeDef *hdts);
/**
  * @}
  */

/* Peripheral Control functions  ************************************************/
/** @addtogroup DTS_Exported_Functions_Group3
  * @{
  */

/**
  * @}
  */

