STMicroelectronics/X-CUBE-NFC4/Drivers/STM32MP1xx_HAL_Driver/Inc/stm32mp1xx_hal_tmpsens.h
/* Peripheral State functions  **************************************************/
/** @addtogroup DTS_Exported_Functions_Group4
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup DTS_Private_Constants DTS Private Constants
  * @{
  */
/** @defgroup DTS_ExtiLine DTS EXTI Lines
  * @{
  */
#if defined(STM32MP1)
#define DTS_EXTI_LINE_DTS1           (EXTI_IMR3_IM72)  /*!< EXTI line 72 connected to DTS1 output */
#endif
/**
  * @}
  */

/** @defgroup DTS_IT_Type DTS IT Type
  * @{
  */
#define DTS_IT_ASYNC  (DTS_IT_TS1_AITEEN | DTS_IT_TS1_AITLEN | DTS_IT_TS1_AITHEN) /*!< DTS ASYNC IT */
#define DTS_IT_SYNC   (DTS_IT_TS1_ITEEN | DTS_IT_TS1_ITLEN | DTS_IT_TS1_ITHEN)    /*!< DTS SYNC IT */
/**
  * @}
  */


/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup DTS_Private_Macros DTS Private Macros
  * @{
  */

/** @defgroup DTS_IS_DTS_Definitions  DTS Private macros to check input parameters
  * @{
  */
#define IS_DTS_QUICKMEAS(__SEL__)   (((__SEL__) == DTS_QUICKMEAS_DISABLE) || \
                                         ((__SEL__) == DTS_QUICKMEAS_ENABLE))

#define IS_DTS_REFCLK(__SEL__)      (((__SEL__) == DTS_REFCLKSEL_LSE) || \
                                         ((__SEL__) == DTS_REFCLKSEL_PCLK))


#define IS_DTS_TRIGGERINPUT(__INPUT__)  (((__INPUT__) == DTS_TRIGGER_HW_NONE)   || \
                                             ((__INPUT__) == DTS_TRIGGER_LPTIMER1)  || \
                                             ((__INPUT__) == DTS_TRIGGER_LPTIMER2)  || \
                                             ((__INPUT__) == DTS_TRIGGER_LPTIMER3)  || \
                                             ((__INPUT__) == DTS_TRIGGER_SYSCFG_EXTI13) || \
                                             ((__INPUT__) == DTS_TRIGGER_HW_NONE_CONT))

#define IS_DTS_INTERRUPTTHRESHOLD(__THRESHOLD__)  ((__THRESHOLD__) <= 0xFFFF)

#define IS_DTS_DIVIDER_RATIO_NUMBER(__NUMBER__) (((__NUMBER__) >= ((uint32_t)2)) && ((__NUMBER__) <= ((uint32_t)127)))

#define IS_DTS_SAMPLINGTIME(__CYCLE__)  (((__CYCLE__) == DTS_SMP_TIME_1_CYCLE)  || \
                                             ((__CYCLE__) == DTS_SMP_TIME_2_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_3_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_4_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_5_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_6_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_7_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_8_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_9_CYCLE)    || \
                                             ((__CYCLE__) == DTS_SMP_TIME_10_CYCLE)   || \
                                             ((__CYCLE__) == DTS_SMP_TIME_11_CYCLE)   || \
                                             ((__CYCLE__) == DTS_SMP_TIME_12_CYCLE)   || \
                                             ((__CYCLE__) == DTS_SMP_TIME_13_CYCLE)   || \
                                             ((__CYCLE__) == DTS_SMP_TIME_14_CYCLE)   || \
                                             ((__CYCLE__) == DTS_SMP_TIME_15_CYCLE))
/* All combinations of interrupts are allowed */
#define IS_DTS_INTERRUPTSOURCE(__SOURCE__)  ((((__SOURCE__) & ~(DTS_IT_ASYNC | DTS_IT_SYNC)) == RESET) && \
                                                 (((__SOURCE__) & (DTS_IT_ASYNC | DTS_IT_SYNC)) != RESET))
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP1xx_HAL_COMP_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
